Repository: kirchners-manta/peacemaker4
Catalog: working-code/pm_meson/subprojects/toml-f/doc/locales/*/LC_MESSAGES/index.po
Languages: es

source: Tutorials
es: Tutoriales

source: How-Tos
es: ¿Cómo?

source: References
es: Referencias

source: TOML Fortran library
es: Biblioteca TOML Fortran

source: License
es: Licencia

source: Version
es: Versión

source: Continuous Integration
es: Integración continua

source: API docs
es: Documentos de la API

source: Documentation Status
es: Estado de la documentación

source: Coverage
es: Cobertura

source: This project provides a library to work with `TOML <https://toml.io>`_ files and data structures and allows to define data serialization and deserialization in Fortran. The currently supported TOML standard is `version 1.0.0 <https://toml.io/en/v1.0.0>`__. The TOML Fortran project is hosted at GitHub at `toml-f/toml-f <https://github.com/toml-f/toml-f>`__.
es: Este proyecto proporciona una biblioteca para trabajar con archivos `TOML <https://toml.io>`_ y estructuras de datos, y permite definir la serialización y deserialización de datos en Fortran.El estándar TOML admitido actualmente es la `versión 1.0.0 <https://toml.io/en/v1.0.0>`__. El proyecto TOML Fortran está hospedado en Github en `toml-f/toml-f <https://github.com/toml-f/toml-f>`__

source: :octicon:`mortar-board` Tutorials
es: :octicon:`mortar-board` Tutoriales

source: Guides and courses for using TOML with complete and self-contained examples.
es: Guías y cursos para usar TOML con ejemplos completos y autocontenidos

source: :octicon:`book` Recipes
es: :octicon:`book` Recetas

source: Examples and recipes for solving common tasks with TOML Fortran.
es: Ejemplos y recetas para resolver tareas comunes con TOML Fortran.

source: :octicon:`gear` Reference
es: :octicon:`gear` Referencia

source: Generated documentation of all procedures and derived types available.
es: Documentación generada de todos los procedimientos y tipos derivados disponibles.

source: :octicon:`arrow-down` Installation
es: :octicon:`arrow-down` Instalación

source: Instructions for installing, updating or compiling TOML Fortran.
es: Instrucciones para la instalación, actualización o compilación de TOML Fortran.

source: :octicon:`mark-github` Repository
es: :octicon:`mark-github` Repositorio

source: GitHub repository for the development of TOML Fortran.
es: Repositorio Github para el desarrollo de TOML Fortran.

source: :octicon:`link` External
es: :octicon:`link` Externos

source: External links to other resources, blogs, etc.
es: Enlaces externos a otros recursos, blogs, etc.

source: TOML Fortran is used for example in the Fortran package manager (`fpm <https://fpm.fortran-lang.org>`_), a typical package manifest specified in TOML is shown below
es: TOML Fortran es usado por ejemplo en el Administrador de paquetes de Fortran (`fpm <https://fpm.fortran-lang.org/es>`_). Un manifiesto típico para un paquete especificado en TOML es mostrado abajo
