Repository: kirchners-manta/peacemaker4
Catalog: working-code/pm_meson/subprojects/toml-f/doc/locales/*/LC_MESSAGES/tutorial.po
Languages: es

source: Getting started
es: Iniciando

source: This tutorial provides a gentle introduction to the use of TOML Fortran. It will deal with reading as well as creating TOML data structures using the high-level build interface and discuss how to obtain a data structure from a TOML document or turn a data structure to TOML document again.
es: Este tutorial proporciona una introducción amable para el uso de TOML Fortran. Tratará de la lectura y creacción de estructuras de datos TOML usando la interfaz de construcción de alto nivel y como obtener una estructura de datos desde un documento TOML o convertir una estrutura de datos en un documento TOML totalmente nuevo.

source: For this project we will be working with fpm, however you can use any build tool you are familar with, checkout the :ref:`integration guide <integration>` to find a matching setup. We start with creating a minimal package manifest to use TOML Fortran in our fpm project.
es: En este proyecto trabajaremos con fpm, no obstante usted puede usar cualquier herramienta de construcción con la que esté familiarizado, consulte la :ref:`guía de integración <integration>` para encontrar una configuración coincidente. Comenzamos creando un manifiesto de paquete mínimo para usar TOML Fortran en nuestro proyecto fpm.

source: The public TOML Fortran API is defined in the ``tomlf`` module, we will only use this module for this entire course. The main data structures we are going to interact with are ``toml_table`` and ``toml_array`` instances, which we can conveniently manipulate with the generic interface ``get_value``.
es: La API pública TOML Fortran es definida en el módulo ``tomlf``, en este curso completo la interfaz genérica ``get_value``.

source: Note that we declare the TOML data structure as mutable, *i.e.* ``intent(inout)`` rather than just ``intent(in)``, as the ``get_value`` interface can modify the data structure. We start with a simple test program which is not actually reading any TOML document, but just passing an empty table to our reader.
es: Note que definimos la estructura de datos TOML como mutable, es decir, ``intent(inout)`` en lugar de solo ``intent(in)``, como la interfaz ``get_value`` puede modificar la estructura de datos. Iniciamos con un programa de prueba simple, que realmente no está leyendo ningún documento TOML, sino solo pasando una tabla vacía a nuesto lector.

source: The ``get_value`` interface for processing the TOML data structure ensures that the data structure is complete throughout the whole process of reading it and will add the requested nodes if there are not present or will fill them in with default values. Convince yourself that the empty table indeed changed while reading by passing a serializer to it.
es: La interfaz ``get_value`` para el procesamiento de la estructura de datos TOML asegura que la estructura de datos esté completa a lo largo del proceso de lectura y agregará los nodos solicitados sino están presentes o los completará con valores predeterminados. Verifique que la tabla vacía realmente cambió durante la lectura pasandole un serializador.

source: This behavior is very convenient because it allows us to define our default values while defining how we read the TOML data structure.
es: Este comportamiento es muy conveniente porque nos permite definir nuestros valores predeterminados al definir como leemos la estructura de datos TOML.

source: The ``get_value`` build interface is only one way of accessing the TOML data structure provided by TOML Fortran. It takes an opinionated approach towards reading and modifying the data structure, which is suitable the majority of applications.
es: La interfaz de construcción ``get_value`` es solo una forma de acceder a la estrutura de datos TOML proporcionado por TOML Fortran. Este toma una aproximación pragmática para la lectura y modificación de la estructura de datos, que es apropiada en la mayoria de las aplicaciones.

source: Now we will actually read a TOML document and pass it to our reader.
es: Ahora leeremos realmente un documento TOML y pasaremos este a nuestro lector.

source: We adapt our command line driver to read the file ``input.toml`` and output the values as before
es: Adaptamos nuestro controlador de linea de comandos para leer el archivo ``input.toml`` y muestra los valores como antes

source: Running the program with fpm shows that we were able to read the correct values from the document
es: Ejecutar el programa con fpm muestra que pudimos leer los valores correctos desde el documento

source: You can again use the serializer to write the final data structure, if you want to check whether the ``get_value`` interface has added default values.
es: Usted puede volver a usar el serializador para escribir la estructura de datos final, si desea verficar si la interfaz ``get_value`` ha adicionado los valores predeterminados.

source: In this tutorial you have learned out to read simple data structures from TOML documents. You can now
es: En este tutorial usted ha aprendido a leer estructuras de datos desde documentos TOML. Ahora puede

source: define the logic to read data from TOML structures
es: definir la lógica para leer datos desde estructuras TOML

source: provide default values in your parser as you define the input structure
es: proporcione valores predeterminados en su analizador a medida que define la estructura de entrada

source: read an actual TOML document from a file
es: leer un documento TOML real desde un archivo

source: write TOML documents from your data structures
es: escribir documentos TOML desde sus estructuras de datos

source: Tutorial courses
es: Cursos tutoriales

source: This section contains self-contained courses teaching the usage of TOML Fortran. Each tutorial is a full example for a specific application covering several aspects of the library.
es: Esta sección contiene cursos autocontenidos que enseñan como usar TOML Fortran. Cada tutorial es un ejemplo completo para una aplicación específica cubriendo múltiples aspectos de la biblioteca.

source: Contributions are welcome!
es: ¡Contribuciones son bienvenidas!

source: If you have written on TOML Fortran and want to contribute to the documentation, feel free to fork the repository and submit a pull request.
es: Si usted ha escrito sobre TOML Fortran y desea contribuir a la documentación, siéntase libre de bifurcar el repositório y envie una solicitud de integración.
